{
  "architectures": [
    "GraniteMoeHybridForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_multiplier": 0.0078125,
  "bos_token_id": 100257,
  "embedding_multiplier": 12,
  "eos_token_id": 100257,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "init_method": "mup",
  "initializer_range": 0.1,
  "intermediate_size": 12800,
  "layer_types": [
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention",
    "attention"
  ],
  "logits_scaling": 16,
  "mamba_chunk_size": 256,
  "mamba_conv_bias": true,
  "mamba_d_conv": 4,
  "mamba_d_head": 64,
  "mamba_d_state": 256,
  "mamba_expand": 2,
  "mamba_n_groups": 1,
  "mamba_n_heads": 128,
  "mamba_proj_bias": false,
  "max_position_embeddings": 131072,
  "model_type": "granitemoehybrid",
  "normalization_function": "rmsnorm",
  "num_attention_heads": 32,
  "num_experts_per_tok": 0,
  "num_hidden_layers": 40,
  "num_key_value_heads": 8,
  "num_local_experts": 0,
  "output_router_logits": false,
  "pad_token_id": 100256,
  "position_embedding_type": "rope",
  "residual_multiplier": 0.22,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000000,
  "router_aux_loss_coef": 0.01,
  "shared_intermediate_size": 12800,
  "tie_word_embeddings": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.56.0",
  "use_cache": true,
  "vocab_size": 100352
}
