{
  "architectures": [
    "GraniteForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "attention_multiplier": 0.0078125,
  "bos_token_id": 100257,
  "embedding_multiplier": 12,
  "eos_token_id": 100257,
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.1,
  "intermediate_size": 12800,
  "logits_scaling": 16,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "granite",
  "num_attention_heads": 32,
  "num_hidden_layers": 40,
  "num_key_value_heads": 8,
  "pad_token_id": 100256,
  "residual_multiplier": 0.22,
  "rms_norm_eps": 1e-05,
  "rope_scaling": null,
  "rope_theta": 10000000,
  "tie_word_embeddings": true,
  "transformers_version": "4.53.3",
  "use_cache": true,
  "vocab_size": 100352
}
